Revit 2024 API
RebarShapeConstraintProjectedSegmentLength Members
The RebarShapeConstraintProjectedSegmentLength type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintProjectedSegmentLength
 Constructs a new instance of a RebarConstraintProjectEdgedLength object using a shape parameter, direction, and reference types.
Methods
Name | Description
Dispose |  (Inherited from RebarShapeConstraint.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParamId
 Return the Id of the parameter associated with this constraint.
 (Inherited from RebarShapeConstraint.)
GetSegmentEndReferenceType
 Choice of two possibilities for the start and end references of the length constraint.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Direction
 A vector specifying the direction of the constraint. The direction is fixed, and the shape is always constructed so that the segment direction has a positive dot product with this vector.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RebarShapeConstraint.)
TripleProductSign
 Sign of the z-coordinate of the cross product of the Direction property with the segment vector. TripleProductSign is 1 if the segment direction is to be on the left of the constraint direction, or -1 if the segment direction is to be on the right.
See Also
RebarShapeConstraintProjectedSegmentLength Class
Autodesk.Revit.DB.Structure Namespace